app/views/users/likes.html.erb

    <% @likes.each do |like| %>
      <% post = Post.find_by(id: like.post_id) %>
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 35], ["LIMIT", 1]]