app/controllers/users_controller.rb

SELECT "users".* FROM "users" ORDER BY "users"."created_at" DESC
---
  def index
    @users = User.all.order(created_at: :desc)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ? ORDER BY "posts"."created_at" DESC  [["user_id", 4]]
---
  def show
    @user = User.find_by(id: params[:id])
    @posts = @user.posts.order(created_at: :desc)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "image_name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["image_name", "4.jpg"], ["updated_at", "2020-03-22 05:21:18.170445"], ["id", 4]]
---
  def update
    @user = User.find_by(id: params[:id])
    @user.name = params[:name]
    @user.email = params[:email]
    if params[:image_name]
      @user.image_name = "#{@user.id}.jpg"
      image = params[:image_name]
      File.binwrite("public/user_images/#{@user.image_name}", image.read)
    end

    if @user.save

INSERT INTO "users" ("name", "email", "image_name", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "sano"], ["email", "sano"], ["image_name", "default_user.jpg"], ["password", "sano"], ["created_at", "2020-03-21 09:04:43.004222"], ["updated_at", "2020-03-21 09:04:43.004222"]]
---
  def create
    @user = User.new(
      name: params[:name],
      email: params[:email],
      password: params[:password],
      image_name: "default_user.jpg"
    )
    if @user.save

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "クランベリー"], ["LIMIT", 1]]
---
  def login
    @user = User.find_by(email: params[:email],)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "likes".* FROM "likes" WHERE "likes"."user_id" = ? ORDER BY "likes"."created_at" DESC  [["user_id", 4]]
---
  def likes
    @user = User.find_by(id: params[:id])
    @likes = Like.where(user_id: @user.id).order(created_at: :desc)