app/models/post.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
---
  def user
    @user = User.find_by(id: self.user_id)